# IdeaStatiCa.RcsApi.Model.Point3D
Represents an x- , y- an z-coordinates in three-dimensional space.

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**X** | **double** | Gets or sets the X-coordinate value | [optional]
**Y** | **double** | Gets or sets the Y-coordinate value | [optional]
**Z** | **double** | Gets or sets the Z-coordinate value | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)